[
	{
		"id": 1,
		"title": "Python Programing Full Course",
		"price": 150,
		"description": "Python is a computer programming language often used to build websites and software, automate tasks, and conduct data analysis. Python is a general-purpose language, meaning it can be used to create a variety of different programs and isn’t specialized for any specific problems. This versatility, along with its beginner-friendliness, has made it one of the most-used programming languages today. Python is commonly used for developing websites and software, task automation, data analysis, and data visualization. Since it’s relatively easy to learn, Python has been adopted by many non-programmers such as accountants and scientists, for a variety of everyday tasks, like organizing finances.",
		"category": "Programing",
		"image": "https://i.ibb.co/vPWns34/python-program-language-code-developer-computer-concept-datum-cyberspace-software-symbol-web-app-app.jpg",
		"rating": 5
	},
	{
		"id": 2,
		"title": "Java Full Course",
		"price": 200,
		"description": "This Java online course with a certificate is a good start for beginners who want to learn the basics of Java. You will first get briefly introduced to the Java Programming language, followed by information on Java IDE installation. You will go through different concepts like variables, data types, operators, arrays, flow control statements, and functions with appropriate code examples.You will also have the opportunity to get started with the first Java program in detail and step into the initial stage of Java programming. This free Java course will introduce you to the world of Java Programming. Explore the fundamentals of Java, like syntax, functions, and arrays. Enroll in this beginner course and kickstart your programming career in Java.",
		"category": "Programing",
		"image": "https://i.ibb.co/TRcQvgk/main-qimg-9e174d5e8f898e3cba6136dc20a9d5a0-lq.jpg",
		"rating": 4.4
	},
	{
		"id": 3,
		"title": "HTML Full Course",
		"price": 55,
		"description": "HTML is the backbone of every website on the internet. If you want to get into web development, learning HTML is the place to start. This full HTML5 course is a great place to begin your journey towards learning web development. Think of this course like a video textbook with 10 clearly defined chapters.  It’s a fundamental part of every web developer’s toolkit. HTML provides the content that gives web pages structure, by using elements and tags, you can add text, images, videos, forms, and more. Learning HTML basics is an important first step in your web development journey and an essential skill for front- and back-end developers.",
		"category": "Structure",
		"image": "https://i.ibb.co/ggzPwRN/html.jpg",
		"rating": 4.7
	},
	{
		"id": 4,
		"title": "Bootstrap Full Course",
		"price": 30,
		"description": "If you want to quickly create a website without writing tons of CSS from scratch, then Bootstrap 4 might be the framework you’re looking for. In this course, you’ll see how Bootstrap makes it easy to layout and create interactive and responsive sites. You’ll learn about Bootstrap’s grid system to construct complex layouts. Then, you’ll style and populate your site using Bootstrap’s utility classes and components. With Bootstrap, HTML, some familiarity with CSS, and JavaScript, you’ll be making websites in no time.",
		"category": "Library",
		"image": "https://i.ibb.co/VYTg65t/flat-750x1000-075-f.jpg",
		"rating": 4.9
	},
	{
		"id": 5,
		"title": "C++ Programing Full Course",
		"price": 245,
		"description": "C++ is a high-level cross-platform general-purpose programming language. It was created at Bell Labs by Bjarne Stroustrup as an extension to the C programming language. C++ employed the object-oriented programming concepts introduced in the 1960s with the Simula 1 and Simula 67 languages. Bjarne Stroustrup described the language as a general-purpose programming language with a bias towards systems programming that is a better C and supports data abstraction, object-oriented programming, and generic programming. C++ is a language for defining and using lightweight abstractions. With its adaptability and fast rendering, you’ll find the C++ programming language used everywhere, from web browsers to game development and operating systems to science and machine learning tools. This course will help you learn C++ basics and give you hands-on experience to create your own projects and work with computer memory.",
		"category": "Programing",
		"image": "https://i.ibb.co/XpnybTh/77fca518c18ea242a72d26e649148567.jpg",
		"rating": 4.5
	},
	{
		"id": 6,
		"title": "Node Full Course",
		"price": 130,
		"description": "There is no doubt that JavaScript is the #1 Programming language in the world and Node.js is one of the biggest reasons for that. Initially, JavaScript was considered just a client-side scripting language but Node.js has changed all that by allowing developers to create dynamic web pages on the server-side using JavaScript. It is also rated as the most popular JavaScript framework for a full-stack developer. The most important benefit of Node.js is that it allows you to build a full-stack application based on just one language, JavaScript. This is especially useful for start-ups that put a lot of emphasis on being able to iterate early and often. If you are a web developer and aspiring to become a full-stack web developer then you should consider learning Node.js sooner than later, 2022 may be just the right time.",
		"category": "Runtime",
		"image": "https://i.ibb.co/q52YHL1/Nodejs.jpg",
		"rating": 5
	},
	{
		"id": 7,
		"title": "JavaScript Full Course",
		"price": 200,
		"description": "JavaScript is a popular programming language used for building web applications, among many other things. In this article, I will provide a list of free online resources where you can start learning JavaScript. After you have learned the basics then you can start building beginner friendly projects. This is an interactive learning environment where you will learn JavaScript by doing hundreds of challenges and five certification algorithm challenges. At the end you can receive a free certification to share on Twitter or put on your LinkedIn profile.",
		"category": "Programing",
		"image": "https://i.ibb.co/Dtrtxmf/HD-wallpaper-java-script-baseball-black-chedesign-javascript-js-metal-music-never-programming-univer.jpg",
		"rating": 4.5
	},
	{
		"id": 8,
		"title": "CSS Full Course",
		"price": 120,
		"description": "Learning how to code HTML without also learning CSS is like learning how to read but not write. All of your hard web development work is lost if you don’t optimize it for different screen sizes. Udemy has top-rated courses to show you how CSS helps you do just that. Consider the devices that you use to access the internet on a daily basis. You’ll notice that there isn’t a standard screen size. Without CSS, rendering a website’s text, layout, and design for these discrepancies in screens would be impossible. CSS is the backbone of all website styling work, and is rightfully considered a cornerstone of internet technology. ",
		"category": "Styles",
		"image": "https://i.ibb.co/fFp9dcK/html5-css3-hd.jpg",
		"rating": 4.7
	}
]
